kaunghtethtun/stm32_study/Firmware V-0.0/STM32CubeIDE/Drivers/rom_drivers/Inc/ROM_LSDB4830_CAFC.h
/*******************************************************************************
 *                    ROM ROBOTICS Co,.Ltd ( Myanmar )    										 *
 *			(?) COPYLEFT 2024		| www.romrobots.com | (+95) 9-259-288-229 				 *
 *******************************************************************************/ 
#ifndef __ROM_LSDB4830_CAFC_H
#define __ROM_LSDB4830_CAFC_H

#include "stm32f4xx_hal.h"
#include "main.h"

#define RIGHT_MOTOR 0x601
#define LEFT_MOTOR 	0x602

//#define POSITION_MODE_ON 1
#define BASIC_MODE_ON 1

#ifdef POSITION_MODE_ON
/* POSITION MODE */
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Operation mode
  *  Attribute = 08S,RW
  *     Unit   = [DEC]
  *  Operation mode
  * 	-3 Speed mode without Acc/Dec
  * 	1 Position mode
  * 	3 Speed mode with Acc/Dec
  *	  4 Torque mode
  */

#define OPERATION_MODE							0x606000
#define OPERATION_MODE_1ST_BYTE			0x60
#define OPERATION_MODE_2ND_BYTE			0x60
#define OPERATION_MODE_3RD_BYTE			0x00
#define SPEED_WITH_ACCEL_DECEL_MODE	3
#define SPEED_MODE									-3
#define TORQUE_MODE									4
#define POSITION_MODE								1
#define UART_OPERATION_MODE					0x7017
#define UART_OPERATION_MODE_H					0x70
#define UART_OPERATION_MODE_L					0x17
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Control Word
  *  Attribute = 16S,RW
  *     Unit   = [HEX]
  */

#define CONTROL_WORD								0x604000
#define CONTROL_WORD_1ST_BYTE				0x40
#define CONTROL_WORD_2ND_BYTE				0x60
#define CONTROL_WORD_3RD_BYTE				0x00
#define CONTROL_WORD_ENABLE					0x0F
#define CONTROL_WORD_DISABLE				0x06
#define CONTROL_WORKD_CLEAR					0x86
#define UART_CONTROL_WORD						0x7019
#define UART_CONTROL_WORD_H					0x70
#define UART_CONTROL_WORD_L					0x19
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Current Operation mode
  *  Attribute = 8S,RO
  *     Unit   = [DEC]
  */

#define CURRENT_OP_MODE							0x606100
#define CURRENT_OP_MODE_1ST_BYTE		0x61
#define CURRENT_OP_MODE_2ND_BYTE		0x60
#define CURRENT_OP_MODE_3RD_BYTE	  0x00
#define UART_CURRENT_OP_MODE 				0x7018
#define UART_CURRENT_OP_MODE_H 			0x70
#define UART_CURRENT_OP_MODE_L 		  0x18
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Driver status word
  *  Attribute = 16U,RO
  *     Unit   = [HEX]
  */

#define DRIVER_STATUS								0x604100
#define DRIVER_STATUS_1ST_BYTE			0x41
#define DRIVER_STATUS_2ND_BYTE			0x60
#define DRIVER_STATUS_3RD_BYTE			0x00
#define DRIVER_STATUS_NORMAL				0x0000
#define DRIVER_STATUS_ERROR					0x0008
#define UART_DRIVER_STATUS 					0x7001
#define UART_DRIVER_STATUS_H 				0x70
#define UART_DRIVER_STATUS_L 				0x01
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Emergency Stop
  *  Attribute = 08U,RW
  *     Unit   = [DEC]
  */

#define EMERGENCY_STOP							0x605A11
#define EMERGENCY_STOP_1ST_BYTE			0x5A
#define EMERGENCY_STOP_2ND_BYTE			0x60
#define EMERGENCY_STOP_3RD_BYTE			0x11
#define EMERGENCY_STOP_ENABLE				1
#define EMERGENCY_STOP_DISABLE			0
#define UART_EMERGENCY_STOP					0x701F
#define UART_EMERGENCY_STOP_H				0x70
#define UART_EMERGENCY_STOP_L				0x1F
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Target position in absolute positioning ( Valid in operation mode 1 )
  *  Attribute = 32S,RW
  *     Unit   = [DEC]
  */

#define ABSOLUTE_TARGET_POSITION		0x607A00
#define ABSOLUTE_TARGET_POSITION_1	0x7A
#define ABSOLUTE_TARGET_POSITION_2	0x60
#define ABSOLUTE_TARGET_POSITION_3	0x00

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Target position in relative positioning ( Valid in operation mode 1 )
  *  Attribute = 32S,RW
  *     Unit   = [DEC]
  */

#define RELATIVE_TARGET_POSITION		0x607B00
#define RELATIVE_TARGET_POSITION_1	0x7B
#define RELATIVE_TARGET_POSITION_2	0x60
#define RELATIVE_TARGET_POSITION_3	0x00
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Profile velocity_rpm ( Target speed in operation mode 1 )
  * Note -> This object will affect the value of object [ 0x7098 ]
  *  Attribute = 16U,RW, S5
  *     Unit   = [rpm]
  */

#define VELOCITY_RPM								0x608200
#define VELOCITY_RPM_1ST_BYTE				0x82
#define VELOCITY_RPM_2ND_BYTE				0x60
#define VELOCITY_RPM_3RD_BYTE				0x00

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Acceleration
  * U[y,x]:
  * [DEC] = [rps/s]*256*[Resolution]/1562
  * 5
  * Resolution = 4096 [ default ]
  *  Attribute = 32U,RW, S5
  *     Unit   = [DEC]
  */

#define ACCELERATION								0x608300
#define ACCELERATION_1ST_BYTE				0x83
#define ACCELERATION_2ND_BYTE				0x60
#define ACCELERATION_3RD_BYTE				0x00

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Deceleration
  * U[y,x]:
  * [DEC] = [rps/s]*256*[Resolution]/1562
  * 5
  * Resolution = 4096 [ default ]
  *  Attribute = 32U,RW, S5
  *     Unit   = [DEC]
  */

#define DECELERATION								0x608400
#define DECELERATION_1ST_BYTE				0x84
#define DECELERATION_2ND_BYTE				0x60
#define DECELERATION_3RD_BYTE				0x00
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Deceleration in emergency stop
  * U[y,x]:
  * [DEC] = [rps/s]*256*[Resolution]/1562
  * 5
  * Resolution = 4096 [ default ]
  *  Attribute = 32U,RW, S5
  *     Unit   = [DEC]
  */

#define DECELERATION_IN_EMERGENCY		0x605A01
#define DECELERATION_IN_EMERGENCY_1	0x5A
#define DECELERATION_IN_EMERGENCY_2	0x60
#define DECELERATION_IN_EMERGENCY_3	0x01
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Following error window
  *  Only valid in mode 1 when Kpp0 is not 0
  *  Attribute = 32U,RW, S5
  *     Unit   = [DEC]
  */

#define FOLLOWING_ERR_WINDOW				0x606500
#define FOLLOWING_ERR_WINDOW				0x65
#define FOLLOWING_ERR_WINDOW				0x60
#define FOLLOWING_ERR_WINDOW				0x00
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Position loop speed feedforward
  *  Only valid in mode 1
  *  Attribute = 16S,RW, S5
  *     Unit   = [DEC]
  */

