kaunghtethtun/stm32_study/Firmware V-0.0/STM32CubeIDE/Drivers/rom_drivers/Inc/ROM_LSDB4830_CAFC.h
#define POS_LOOP_SPEED_FF						0x60FB02
#define POS_LOOP_SPEED_FF_1					0xFB
#define POS_LOOP_SPEED_FF_2					0x60
#define POS_LOOP_SPEED_FF_3					0x02

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Kpp0, propotion gain 0 in position loop
  *  Attribute = 16S,RW, S5
  *     Unit   = [DEC]
  */

#define PROPOTION_GAIN_IN_POS				0x60FB01
#define PROPOTION_GAIN_IN_POS_1			0xFB
#define PROPOTION_GAIN_IN_POS_2			0x60
#define PROPOTION_GAIN_IN_POS_3			0x01

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Kvp0,propotion gain 0 in speed loop
  *  Attribute = 16U,RW, S5
  *     Unit   = [DEC]
  */

#define PROPOTION_GAIN_IN_SPEED			0x60F901
#define PROPOTION_GAIN_IN_SPEED_1		0xF9
#define PROPOTION_GAIN_IN_SPEED_2		0x60
#define PROPOTION_GAIN_IN_SPEED_3		0x01

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Kvi0,integrator gain 0 in speed loop
  *  Attribute = 16U,RW, S5
  *     Unit   = [DEC]
  */

#define INTEGRATOR_GAIN_IN_SPEED		0x60F902
#define INTEGRATOR_GAIN_IN_SPEED_1	0xF9
#define INTEGRATOR_GAIN_IN_SPEED_2	0x60
#define INTEGRATOR_GAIN_IN_SPEED_3	0x02
#else 
/* SPEED MODE */
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Operation mode
  *  Attribute = 08S,RW,S5
  *     Unit   = [DEC]
  *  Operation mode
  * 	-3 Speed mode without Acc/Dec
  * 	1 Position mode
  * 	3 Speed mode with Acc/Dec
  *		4 Torque mode
  */

#define OPERATION_MODE							0x606000
#define OPERATION_MODE_1ST_BYTE			0x60
#define OPERATION_MODE_2ND_BYTE			0x60
#define OPERATION_MODE_3RD_BYTE			0x00
#define SPEED_MODE_WITH_ACCEL_DECEL	3
#define SPEED_MODE									-3
#define TORQUE_MODE									4
#define POSITION_MODE								1
#define UART_OPERATION_MODE					0x7017
#define UART_OPERATION_MODE_H				0x70
#define UART_OPERATION_MODE_L				0x17
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Control Word
  *  Attribute = 16S,RW
  *     Unit   = [HEX]
  */

#define CONTROL_WORD								0x604000
#define CONTROL_WORD_1ST_BYTE				0x40
#define CONTROL_WORD_2ND_BYTE				0x60
#define CONTROL_WORD_3RD_BYTE				0x00
#define CONTROL_WORD_ENABLE					(int16_t)0x0F
#define CONTROL_WORD_DISABLE				(int16_t)0x06
#define CONTROL_WORD_CLEAR					(int16_t)0x86
#define UART_CONTROL_WORD						0x7019
#define UART_CONTROL_WORD_H					0x70
#define UART_CONTROL_WORD_L					0x19
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Current Operation mode
  *  Attribute = 8S,RO
  *     Unit   = [DEC]
  */

#define CURRENT_OP_MODE							0x606100
#define CURRENT_OP_MODE_1ST_BYTE		0x61
#define CURRENT_OP_MODE_2ND_BYTE		0x60
#define CURRENT_OP_MODE_3RD_BYTE	  0x00
#define UART_CURRENT_OP_MODE				0x7018
#define UART_CURRENT_OP_MODE_H			0x70
#define UART_CURRENT_OP_MODE_L			0x18

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Driver status word
  *  Details of error information refer to object address[0x7011]
  *  Attribute = 16U,RO
  *     Unit   = [HEX]
  */

#define DRIVER_STATUS								0x604100
#define DRIVER_STATUS_1ST_BYTE			0x41
#define DRIVER_STATUS_2ND_BYTE			0x60
#define DRIVER_STATUS_3RD_BYTE			0x00
#define DRIVER_STATUS_NORMAL				0x0000U
#define DRIVER_STATUS_ERROR					0x0008U
#define UART_DRIVER_STATUS					0x7001
#define UART_DRIVER_STATUS_H				0x70
#define UART_DRIVER_STATUS_L			  0x01
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Emergency Stop
  *  Attribute = 08U,RW
  *     Unit   = [DEC]
  */

#define EMERGENCY_STOP							0x605A11
#define EMERGENCY_STOP_1ST_BYTE			0x5A
#define EMERGENCY_STOP_2ND_BYTE			0x60
#define EMERGENCY_STOP_3RD_BYTE			0x11
#define EMERGENCY_STOP_ENABLE				1
#define EMERGENCY_STOP_DISABLE			0
#define UART_EMERGENCY_STOP					0x701F
#define UART_EMERGENCY_STOP_H				0x70
#define UART_EMERGENCY_STOP_L				0x1F
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Acceleration
  * U[y,x]:
  * [DEC] = [rps/s]*256*[Resolution]/1562
  * Resolution = 4096 [ default ]
  *  Attribute = 32U,RW, S5
  *     Unit   = [DEC]
  */

#define ACCELERATION								0x608300
#define ACCELERATION_1ST_BYTE				0x83
#define ACCELERATION_2ND_BYTE				0x60
#define ACCELERATION_3RD_BYTE				0x00
#define UART_ACCELERATION						0x7099
#define UART_ACCELERATION_H					0x70
#define UART_ACCELERATION_L					0x99

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Deceleration
  * U[y,x]:
  * [DEC] = [rps/s]*256*[Resolution]/1562
  * Resolution = 4096 [ default ]
  *  Attribute = 32U,RW, S5
  *     Unit   = [DEC]
  */

#define DECELERATION								0x608400
#define DECELERATION_1ST_BYTE				0x84
#define DECELERATION_2ND_BYTE				0x60
#define DECELERATION_3RD_BYTE				0x00
#define UART_DECELERATION						0x709A
#define UART_DECELERATION_H					0x70
#define UART_DECELERATION_L					0x9A
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Deceleration in emergency stop
  * U[y,x]:
  * [DEC] = [rps/s]*256*[Resolution]/1562
  * Resolution = 4096 [ default ]
  *  Attribute = 32U,RW, S5
  *     Unit   = [DEC]
  */

#define DECELERATION_IN_EMERGENCY						0x605A01
#define DECELERATION_IN_EMERGENCY_1					0x5A
#define DECELERATION_IN_EMERGENCY_2					0x60
#define DECELERATION_IN_EMERGENCY_3					0x01
#define UART_DECELERATION_IN_EMERGENCY			0x709B
#define UART_DECELERATION_IN_EMERGENCY_H		0x70
#define UART_DECELERATION_IN_EMERGENCY_L		0x9B
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Target Velocity_rpm
  *  Valid in operation mode 3,-3
  *  Note:It will affect the value of object address [0x70B2]
  *  Attribute = 16S,RW
  *     Unit   = [rpm]
  */

#define DESIRE_VEL_RPM							0x2FF009
#define DESIRE_VEL_RPM_1ST_BYTE			0xF0
#define DESIRE_VEL_RPM_2ND_BYTE			0x2F
#define DESIRE_VEL_RPM_3RD_BYTE			0x09
#define UART_DESIRE_VEL_RPM					0x70B1
#define UART_DESIRE_VEL_RPM_H				0x70
#define UART_DESIRE_VEL_RPM_L				0xB1
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Target Velocity_dec
  *  Valid in operation mode 3,-3
  *  U[y,x]:
  *   [DEC]=([rpm]*512*[Resolution])/1875;
  *   Resolution Default : 4096
  *  Attribute = 32S,RW
  *     Unit   = [DEC]
  */

