kaunghtethtun/stm32_study/Firmware V-0.0/STM32CubeIDE/Drivers/rom_drivers/Inc/ROM_LSDB4830_CAFC.h
#define DESIRE_VEL_DEC							0x60FF00
#define DESIRE_VEL_DEC_1ST_BYTE			0xFF
#define DESIRE_VEL_DEC_2ND_BYTE			0x60
#define DESIRE_VEL_DEC_3RD_BYTE			0x00
#define UART_DESIRE_VEL_DEC					0x70B2
#define UART_DESIRE_VEL_DEC_H				0x70
#define UART_DESIRE_VEL_DEC_L				0xB2
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Max following error
  *  Only valid in mode 1 when Kpp0 is not 0
  *  Attribute = 32U,RW, S5
  *     Unit   = [DEC]
  */

#define MAX_FOLLOWING_ERR						0x606500
#define MAX_FOLLOWING_ERR_1ST_BYTE	0x65
#define MAX_FOLLOWING_ERR_2ND_BYTE	0x60
#define MAX_FOLLOWING_ERR_3RD_BYTE	0x00
#define UART_MAX_FOLLOWING_ERR			0x7093
#define UART_MAX_FOLLOWING_ERR_H		0x70
#define UART_MAX_FOLLOWING_ERR_L		0x93
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Position loop speed feedforward
  *  valid in mode 1
  *  Range:0~256,corresponding to 0~100%
  *  Attribute = 16S,RW, S5
  *     Unit   = [DEC]
  */

#define POS_LOOP_SPEED_FF						0x60FB02
#define POS_LOOP_SPEED_FF_1ST_BYTE	0xFB
#define POS_LOOP_SPEED_FF_2ND_BYTE	0x60
#define POS_LOOP_SPEED_FF_3RD_BYTE	0x02
#define UART_POS_LOOP_SPEED_FF			0x709C
#define UART_POS_LOOP_SPEED_FF_H		0x70
#define UART_POS_LOOP_SPEED_FF_L		0x9C
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Kpp0, propotion gain 0 in position loop
  *  Attribute = 16S,RW, S5
  *     Unit   = [DEC]
  */

#define PROPOTION_GAIN_IN_POSITION					0x60FB01
#define PROPOTION_GAIN_IN_POS_1							0xFB
#define PROPOTION_GAIN_IN_POS_2							0x60
#define PROPOTION_GAIN_IN_POS_3							0x01
#define UART_PROPOTION_GAIN_IN_POSITION 		0x7094
#define UART_PROPOTION_GAIN_IN_POSITION_H 	0x70
#define UART_PROPOTION_GAIN_IN_POSITION_L 	0x94
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Kvp0,propotion gain 0 in speed loop
  *  Attribute = 16U,RW, S5
  *     Unit   = [DEC]
  */

#define PROPOTION_GAIN_IN_SPEED					0x60F901
#define PROPOTION_GAIN_IN_SPEED_1				0xF9
#define PROPOTION_GAIN_IN_SPEED_2				0x60
#define PROPOTION_GAIN_IN_SPEED_3				0x01
#define UART_PROPOTION_GAIN_IN_SPEED		0x70B3
#define UART_PROPOTION_GAIN_IN_SPEED_H	0x70
#define UART_PROPOTION_GAIN_IN_SPEED_L	0xB3
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Kvi0,integrator gain 0 in speed loop
  *  Attribute = 16U,RW, S5
  *     Unit   = [DEC]
  */

#define INTEGRATOR_GAIN_IN_SPEED					0x60F902
#define INTEGRATOR_GAIN_IN_SPEED_1				0xF9
#define INTEGRATOR_GAIN_IN_SPEED_2				0x60
#define INTEGRATOR_GAIN_IN_SPEED_3				0x02
#define UART_INTEGRATOR_GAIN_IN_SPEED			0x70B4
#define UART_INTEGRATOR_GAIN_IN_SPEED_H		0x70
#define UART_INTEGRATOR_GAIN_IN_SPEED_L		0xB4
/* SPEED MODE END */
#endif

#ifdef BASIC_MODE_ON
/* BASIC MODE START */
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Operation mode
  *  Attribute = 08S,RW,S5
  *     Unit   = [DEC]
  *  Operation mode
  * 	-3 Speed mode without Acc/Dec
  * 	1 Position mode
  * 	3 Speed mode with Acc/Dec
  *		4 Torque mode
  */

#define OPERATION_MODE							0x606000
#define OPERATION_MODE_1ST_BYTE			0x60
#define OPERATION_MODE_2ND_BYTE			0x60
#define OPERATION_MODE_3RD_BYTE			0x00
#define SPEED_MODE_WITH_ACCEL_DECEL	3
#define SPEED_MODE									-3
#define TORQUE_MODE									4
#define POSITION_MODE								1

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Control Word
  *  Attribute = 16S,RW
  *     Unit   = [HEX]
  */

#define CONTROL_WORD								0x604000
#define CONTROL_WORD_1ST_BYTE				0x40
#define CONTROL_WORD_2ND_BYTE				0x60
#define CONTROL_WORD_3RD_BYTE				0x00
#define CONTROL_WORD_ENABLE					(int16_t)0x0F
#define CONTROL_WORD_DISABLE				(int16_t)0x06
#define CONTROL_WORKD_CLEAR					(int16_t)0x86

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Current Operation mode
  *  Attribute = 08S,RO
  *     Unit   = [DEC]
  */

#define CURRENT_OP_MODE							0x606100
#define CURRENT_OP_MODE_1ST_BYTE		0x61
#define CURRENT_OP_MODE_2ND_BYTE		0x60
#define CURRENT_OP_MODE_3RD_BYTE	  0x00


/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Driver status word
  *  Details of error information refer to object address[0x7011]
  *  Attribute = 16U,RO
  *     Unit   = [HEX]
  */

#define DRIVER_STATUS								0x604100
#define DRIVER_STATUS_1ST_BYTE			0x41
#define DRIVER_STATUS_2ND_BYTE			0x60
#define DRIVER_STATUS_3RD_BYTE			0x00
#define DRIVER_STATUS_NORMAL				0x0000U
#define DRIVER_STATUS_ERROR					0x0008U
#define DRIVER_STATUS_ERROR_1ST_B		0x08U

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Driver error code 1
  * Each bit indicates one error as shown in follows:
  * Attribute = 16U,RO
  *    Unit   = [HEX]
  */
	
#define DRIVER_ERROR 								0x260100
#define DRIVER_ERROR_1ST_BYTE 			0x01
#define DRIVER_ERROR_2ND_BYTE 			0x26
#define DRIVER_ERROR_3RD_BYTE 			0x00
//#define DRIVER_ERROR_INTERNAL_ERROR //TO CHECK PDF FOR BIT REGISTER ASSIGN
#define UART_DRIVER_ERROR						0x7011
#define UART_DRIVER_ERROR_H					0x70
#define UART_DRIVER_ERROR_L					0x11
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Emergency Stop
  *  Attribute = 08U,RW
  *     Unit   = [DEC]
  */

#define EMERGENCY_STOP							0x605A11
#define EMERGENCY_STOP_1ST_BYTE			0x5A
#define EMERGENCY_STOP_2ND_BYTE			0x60
#define EMERGENCY_STOP_3RD_BYTE			0x11
#define EMERGENCY_STOP_ENABLE				1
#define EMERGENCY_STOP_DISABLE			0

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Target position in absolute positioning ( Valid in operation mode 1 )
  *  Attribute = 32S,RW
  *     Unit   = [DEC]
  */

#define ABSOLUTE_TARGET_POSITION					0x607A00
#define ABSOLUTE_TARGET_POSITION_1				0x7A
#define ABSOLUTE_TARGET_POSITION_2				0x60
#define ABSOLUTE_TARGET_POSITION_3				0x00
#define UART_ABSOLUTE_TARGET_POSITION			0x7091
#define UART_ABSOLUTE_TARGET_POSITION_H		0x70
#define UART_ABSOLUTE_TARGET_POSITION_L		0x91
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Target position in relative positioning ( Valid in operation mode 1 )
  *  Attribute = 32S,RW
  *     Unit   = [DEC]
  */

#define RELATIVE_TARGET_POSITION					0x607B00
#define RELATIVE_TARGET_POSITION_1				0x7B
#define RELATIVE_TARGET_POSITION_2				0x60
#define RELATIVE_TARGET_POSITION_3				0x00
#define UART_RELATIVE_TARGET_POSITION			0x709F
#define UART_RELATIVE_TARGET_POSITION_H		0x70
#define UART_RELATIVE_TARGET_POSITION_L		0x9F
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Profile velocity_dec ( valid in operation mode 1 )
	* U[y,x]:
  *	[DEC]=([rpm]*512*[Resolution])/1875; [Resolution]Default:4096
  *  Attribute = 32U,RW, S5
  *     Unit   = [DEC]
  */

