kaunghtethtun/stm32_study/Firmware V-0.0/STM32CubeIDE/Drivers/rom_drivers/Inc/ROM_LSDB4830_CAFC.h
#define VELOCITY_DEC  				 			0x608100
#define VELOCITY_DEC_1ST_BYTE  			0x81
#define VELOCITY_DEC_2ND_BYTE  			0x60
#define VELOCITY_DEC_3RD_BYTE  			0x00
#define UART_VELOCITY_DEC 					0x7098
#define UART_VELOCITY_DEC_H 				0x70
#define UART_VELOCITY_DEC_L 				0x98
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Profile velocity_rpm ( Target speed in operation mode 1 )
  * Note -> This object will affect the value of object [ 0x7098 ]
  *  Attribute = 16U,RW, S5
  *     Unit   = [rpm]
  */

#define VELOCITY_RPM								0x608200
#define VELOCITY_RPM_1ST_BYTE				0x82
#define VELOCITY_RPM_2ND_BYTE				0x60
#define VELOCITY_RPM_3RD_BYTE				0x00
#define UART_VELOCITY_RPM						0x709D
#define UART_VELOCITY_RPM_H					0x70
#define UART_VELOCITY_RPM_L					0x9D
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Acceleration
  * U[y,x]:
  * [DEC] = [rps/s]*256*[Resolution]/1562
  * 5
  * Resolution = 4096 [ default ]
  *  Attribute = 32U,RW, S5
  *     Unit   = [DEC]
  */

#define ACCELERATION								0x608300
#define ACCELERATION_1ST_BYTE				0x83
#define ACCELERATION_2ND_BYTE				0x60
#define ACCELERATION_3RD_BYTE				0x00

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Deceleration
  * U[y,x]:
  * [DEC] = [rps/s]*256*[Resolution]/1562
  * 5
  * Resolution = 4096 [ default ]
  *  Attribute = 32U,RW, S5
  *     Unit   = [DEC]
  */

#define DECELERATION								0x608400
#define DECELERATION_1ST_BYTE				0x84
#define DECELERATION_2ND_BYTE				0x60
#define DECELERATION_3RD_BYTE				0x00

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Deceleration in emergency stop
  * U[y,x]:
  * [DEC] = [rps/s]*256*[Resolution]/1562
  * Resolution = 4096 [ default ]
  *  Attribute = 32U,RW, S5
  *     Unit   = [DEC]
  */

#define DECELERATION_IN_EMERGENCY		0x605A01
#define DECELERATION_IN_EMERGENCY_1	0x5A
#define DECELERATION_IN_EMERGENCY_2	0x60
#define DECELERATION_IN_EMERGENCY_3	0x01

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Target Velocity_rpm
  *  Valid in operation mode 3,-3
  *  Note:It will affect the value of object address [0x70B2]
  *  Attribute = 16S,RW
  *     Unit   = [rpm]
  */

#define DESIRE_VEL_RPM							0x2FF009
#define DESIRE_VEL_RPM_1ST_BYTE			0xF0
#define DESIRE_VEL_RPM_2ND_BYTE			0x2F
#define DESIRE_VEL_RPM_3RD_BYTE			0x09

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Target Velocity_dec
  *  Valid in operation mode 3,-3
  *  U[y,x]:
  *   [DEC]=([rpm]*512*[Resolution])/1875;
  *   Resolution Default : 4096
  *  Attribute = 32S,RW
  *     Unit   = [DEC]
  */

#define DESIRE_VEL_DEC							0x60FF00
#define DESIRE_VEL_DEC_1ST_BYTE			0xFF
#define DESIRE_VEL_DEC_2ND_BYTE			0x60
#define DESIRE_VEL_DEC_3RD_BYTE			0x00

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Output current
  *  （Setting output current for operation mode 4）
  *  U[y,x]:
  *   [DEC]=[Arms]*1.414*2048/Driver max. output current
	*		L2DB4830 max. output current is 33Ap
  *  Attribute = 16S,RW
  *     Unit   = [DEC]
  */

#define OUTPUT_CURRENT    				  0x60F608
#define OUTPUT_CURRENT_1ST_BYTE     0xF6
#define OUTPUT_CURRENT_2ND_BYTE     0x60
#define OUTPUT_CURRENT_3RD_BYTE	    0x08
#define UART_OUTPUT_CURRENT					0x70E1
#define UART_OUTPUT_CURRENT_H				0x70
#define UART_OUTPUT_CURRENT_L				0xE1
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Output current limit
  * Valid in all operation mode
  *  U[y,x]:
  *   [DEC]=[Arms]*1.414*2048/Driver max. output current
	*		L2DB4830 max. output current is 33Ap
  *  Attribute = 16U,RW
  *     Unit   = [DEC]
  */

#define OUTPUT_CURRENT_LIMIT        0x607300
#define OUTPUT_CURRENT_LIMIT_1    	0x73
#define OUTPUT_CURRENT_LIMIT_2   		0x60
#define OUTPUT_CURRENT_LIMIT_3    	0x00
#define UART_OUTPUT_CURRENT_LIMIT		0x70E2
#define UART_OUTPUT_CURRENT_LIMIT_H	0x70
#define UART_OUTPUT_CURRENT_LIMIT_L	0xE2
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Max. speed_rpm
  * Setting maximum speed in all operation mode
  *  Attribute = 16U,RW,S5
  *     Unit   = [DEC]
  */
	
#define MAX_SPEED_RPM              	0x608000
#define MAX_SPEED_RPM_1ST_BYTE     	0x80
#define MAX_SPEED_RPM_2ND_BYTE     	0x60
#define MAX_SPEED_RPM_3RD_BYTE     	0x00
#define UART_MAX_SPEED_RPM 					0x70B8
#define UART_MAX_SPEED_RPM_H 				0x70
#define UART_MAX_SPEED_RPM_L 				0xB8
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Max. position following error
  * Valid in operation mode 1 when "Kpp" is not 0
  *  Attribute = 32U,RW,S5
  *     Unit   = [DEC]
  */
	
#define MAX_POS_FOLLOWING_ERROR     0x606500
#define MAX_POS_FOLLOWING_ERR0R_1   0x65
#define MAX_POS_FOLLOWING_ERROR_2   0x60
#define MAX_POS_FOLLOWING_ERROR_3   0x00

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Position compensation for operation mode 3:
  *  Attribute = 08U,RW,S5
  *     Unit   = [DEC]
  */
	
#define POS_COMPENSATION            0x60FB88
#define POS_COMPENSATION_1ST_BYTE   0xFB
#define POS_COMPENSATION_2ND_BYTE   0x60
#define POS_COMPENSATION_3RD_BYTE   0x88
#define POS_COMPENSATION_DISABLE    0
#define POS_COMPENSATION_ENABLE			1
#define UART_POS_COMPENSATION 			0x8088
#define UART_POS_COMPENSATION_H 		0x80
#define UART_POS_COMPENSATION_L 		0x88
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Position loop speed feedforward
  *  valid in mode 1
  *  Range:0~256,corresponding to 0~100%
  *  Attribute = 16S,RW, S5
  *     Unit   = [DEC]
  */

#define POS_LOOP_SPEED_FF						0x60FB02
#define POS_LOOP_SPEED_FF_1ST_BYTE	0xFB
#define POS_LOOP_SPEED_FF_2ND_BYTE	0x60
#define POS_LOOP_SPEED_FF_3RD_BYTE	0x02

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Kpp0, propotion gain 0 in position loop
  *  Attribute = 16S,RW, S5
  *     Unit   = [DEC]
  */

#define PROPOTION_GAIN_IN_POSITION	0x60FB01
#define PROPOTION_GAIN_IN_POS_1			0xFB
#define PROPOTION_GAIN_IN_POS_2			0x60
#define PROPOTION_GAIN_IN_POS_3			0x01

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Kvp0,propotion gain 0 in speed loop
  *  Attribute = 16U,RW, S5
  *     Unit   = [DEC]
  */

#define PROPOTION_GAIN_IN_SPEED			0x60F901
#define PROPOTION_GAIN_IN_SPEED_1		0xF9
#define PROPOTION_GAIN_IN_SPEED_2		0x60
#define PROPOTION_GAIN_IN_SPEED_3		0x01

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Kvi0,integrator gain 0 in speed loop
  *  Attribute = 16U,RW, S5
  *     Unit   = [DEC]
  */

#define INTEGRATOR_GAIN_IN_SPEED		0x60F902
#define INTEGRATOR_GAIN_IN_SPEED_1	0xF9
#define INTEGRATOR_GAIN_IN_SPEED_2	0x60
#define INTEGRATOR_GAIN_IN_SPEED_3	0x02

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Clear actual position
	* Set 1 to clear "Actual position" when motor is disable
  *  Attribute = 08U,RW
  *     Unit   = [DEC]
  */

#define CLEAR_ACTUAL_POSITION          0x607C02
#define CLEAR_ACTUAL_POSITION_1Byte    0x7C
#define CLEAR_ACTUAL_POSITION_2Byte    0x60
#define CLEAR_ACTUAL_POSITION_3Byte    0x02
#define UART_CLEAR_ACTUAL_POSITION		 0x70AC
#define UART_CLEAR_ACTUAL_POSITION_H	 0x70
#define UART_CLEAR_ACTUAL_POSITION_L	 0xAC
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Noise reduction at zero speed
  *  Attribute = 08U,RW,S5
  *     Unit   = [DEC]
  */
	
#define NOISE_REDUCTION          				0x500050
#define NOISE_REDUCTION_1Byte        		0x00
#define NOISE_REDUCTION_2Byte        		0x50
#define NOISE_REDUCTION_3Byte        		0x50
#define NOISE_REDUCTION_DISABLE  				0   //DEFALUT
#define NOISE_REDUCTION_ENABLE   				1
#define UART_NOISE_REDUCTION						0x701C
#define UART_NOISE_REDUCTION_H					0x70
#define UART_NOISE_REDUCTION_L					0x1C
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Noise reduction delay time for enable
	* Defalut:500
  *  Attribute = 16U,RW,S5
  *     Unit   = [mS]
  */
	
#define NOISE_REDUCT_DELAY_TIME     		0x500051
#define NOISE_REDUCT_DELAY_TIME_1   		0x00
#define NOISE_REDUCT_DELAY_TIME_2   		0x50
#define NOISE_REDUCT_DELAY_TIME_3   		0x51
#define UART_NOISE_REDUCT_DELAY_TIME 		0x701D
#define UART_NOISE_REDUCT_DELAY_TIME_H 	0x70
#define UART_NOISE_REDUCT_DELAY_TIME_L 	0x1D
/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Max. temperature for driver over-temperature protection
  *  Attribute = 16U,RW,S3
  *     Unit   = ['C]
  */
	
#define MAX_TEMPERATURE_DRIVER      		0x300015
#define MAX_TEMPERATURE_DRIVER_1    		0x00
#define MAX_TEMPERATURE_DRIVER_2    		0x30
#define MAX_TEMPERATURE_DRIVER_3    		0x15
#define UART_MAX_TEMPERATURE_DRIVER 		0x7004
#define UART_MAX_TEMPERATURE_DRIVER_H 	0x70
#define UART_MAX_TEMPERATURE_DRIVER_L 	0x04
/* BASIC MODE END */
#endif


/* MOTOR PARAMTER START */

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Current motor code
 * Attribute = 16U,RO
 *  Unit = [HEX]
 */

#define CURRENT_MOTOR_CODE      		0x641016
#define CURRENT_MOTOR_CODE_1 				0x10
#define CURRENT_MOTOR_CODE_2				0x64
#define CURRENT_MOTOR_CODE_3    		0x16
#define UART_CURRENT_MOTOR_CODE			0x7046
#define UART_CURRENT_MOTOR_CODE_H		0x70
#define UART_CURRENT_MOTOR_CODE_L		0x46
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Motor code setting
 * Attribute = 16U,RW,S4
 *   Unit = [HEX]
 */

#define MOTOR_CODE_SETTING     	  	0x641001
#define MOTOR_CODE_SETTING_1      	0x10
#define MOTOR_CODE_SETTING_2      	0x64
#define MOTOR_CODE_SETTING_3      	0x01
#define UART_MOTOR_CODE_SETTING			0x7031
#define UART_MOTOR_CODE_SETTING_H		0x70
#define UART_MOTOR_CODE_SETTING_L		0x31
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Feedback type
 * Attribute = 08U,RW,S4
 *   Unit = [HEX]
 */

#define FEEDBACK_TYPE								0x641002
#define FEEDBACK_TYPE_1							0x10
#define FEEDBACK_TYPE_2							0x64
#define FEEDBACK_TYPE_3							0x02
#define UART_FEEDBACK_TYPE					0x7032
#define UART_FEEDBACK_TYPE_H				0x70
#define UART_FEEDBACK_TYPE_L				0x32
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Encoder resolution
 * Defalut:4096
 * Attribute = 32U,RW,S4
 *   Unit = [DEC]
 */

#define ENCODER_RESOLUTION					0x641003
#define ENCODER_RESOLUTION_1				0x10
#define ENCODER_RESOLUTION_2				0x64
#define ENCODER_RESOLUTION_3				0x03	
#define UART_ENCODER_RESOLUTION			0x7033
#define UART_ENCODER_RESOLUTION_H		0x70
#define UART_ENCODER_RESOLUTION_L		0x33
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Motor pole pair
 * Attribute = 08U,RW,S4
 *   Unit = [DEC]
 */

