kaunghtethtun/stm32_study/Firmware V-0.0/STM32CubeIDE/Drivers/rom_drivers/Inc/ROM_LSDB4830_CAFC.h
#define MOTOR_POLE_PAIR							0x641005
#define MOTOR_POLE_PAIR_1						0x10
#define MOTOR_POLE_PAIR_2						0x64
#define MOTOR_POLE_PAIR_3						0x05
#define UART_MOTOR_POLE_PAIR				0x7035
#define UART_MOTOR_POLE_PAIR_H			0x70
#define UART_MOTOR_POLE_PAIR_L			0x35
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Exciting mode
 * Attribute = 08U,RW,S4
 *   Unit = [DEC]
 */

#define EXCITING_MODE								0x641006
#define EXCITING_MODE_1							0x10
#define EXCITING_MODE_2							0x64
#define EXCITING_MODE_3							0x06
#define UART_EXCITING_MODE					0x7036
#define UART_EXCITING_MODE_H				0x70
#define UART_EXCITING_MODE_L				0x36
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Exciting current
 * Attribute = 16S,RW,S4
 *   Unit = [DEC]
 */

#define EXCITING_CURRENT						0x641007
#define EXCITING_CURRENT_1					0x10
#define EXCITING_CURRENT_2					0x64
#define EXCITING_CURRENT_3					0x07
#define UART_EXCITING_CURRENT				0x7037
#define UART_EXCITING_CURRENT_H			0x70
#define UART_EXCITING_CURRENT_L			0x37
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Exciting time
 * Attribute = 16U,RW,S4
 *   Unit = [ms]
 */

#define EXCITING_TIME								0x641008
#define EXCITING_TIME_1							0x10
#define EXCITING_TIME_2							0x64
#define EXCITING_TIME_3							0x08
#define UART_EXCITING_TIME					0x7038
#define UART_EXCITING_TIME_H				0x70
#define UART_EXCITING_TIME_L				0x38	
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Motor IIt current 
 * Attribute = 16U,RW,S4
 *   Unit = [0.1A]
 */
 
#define MOTOR_IIT_CURRENT						0x641009
#define MOTOR_IIT_CURRENT_1					0x10
#define MOTOR_IIT_CURRENT_2					0x64
#define MOTOR_IIT_CURRENT_3					0x09
#define UART_MOTOR_IIT_CURRENT			0x7039
#define UART_MOTOR_IIT_CURRENT_H		0x70
#define UART_MOTOR_IIT_CURRENT_L		0x39
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Motor IIt time
 * Attribute = 16U,RW,S4
 *   Unit = [S]
 */

#define MOTOR_IIT_TIME							0x64100A
#define MOTOR_IIT_TIME_1						0x10
#define MOTOR_IIT_TIME_2						0x64
#define MOTOR_IIT_TIME_3						0x0A
#define UART_MOTOR_IIT_TIME					0x703A
#define UART_MOTOR_IIT_TIME_H				0x70
#define UART_MOTOR_IIT_TIME_L				0x3A
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Motor max. current
 * Attribute = 16U,RW,S4
 *   Unit = [0.1A]
 */

#define MOTOR_MAX_CURRENT						0x64100B
#define MOTOR_MAX_CURRENT_1					0x10
#define MOTOR_MAX_CURRENT_2					0x64
#define MOTOR_MAX_CURRENT_3					0x0B
#define UART_MOTOR_MAX_CURRENT			0x703B
#define UART_MOTOR_MAX_CURRENT_H		0x70
#define UART_MOTOR_MAX_CURRENT_L		0x3B
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Motor rotation direction
 * Attribute = 08U,RW,S4
 *   Unit = [DEC]
 */

#define MOTOR_ROTATION_DIR					0x641013
#define MOTOR_ROTATION_DIR_1				0x10
#define MOTOR_ROTATION_DIR_2				0x64
#define MOTOR_ROTATION_DIR_3				0x13
#define UART_MOTOR_ROTATION_DIR			0x7043
#define UART_MOTOR_ROTATION_DIR_H		0x70
#define UART_MOTOR_ROTATION_DIR_L		0x43
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Motor rated speed 
 * Attribute = 16U,RW,S4
 *   Unit = [rpm]
 */
 
#define MOTOR_RATED_SPEED						0x64101A
#define MOTOR_RATED_SPEED_1					0x10
#define MOTOR_RATED_SPEED_2					0x64
#define MOTOR_RATED_SPEED_3					0x1A
#define UART_MOTOR_RATED_SPEED			0x704A
#define UART_MOTOR_RATED_SPEED_H		0x70
#define UART_MOTOR_RATED_SPEED_L		0x4A
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Motor rated power 
 * Attribute = 16U,RW,S4
 *   Unit = [W]
 */
 
#define MOTOR_RATED_PW							0x64101B
#define MOTOR_RATED_PW_1						0x10
#define MOTOR_RATED_PW_2						0x64
#define MOTOR_RATED_PW_3						0x1B
#define UART_MOTOR_RATED_PW					0x704B
#define UART_MOTOR_RATED_PW_H				0x70
#define UART_MOTOR_RATED_PW_L				0x4B
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Motor hall angle
 * Attribute = 16U,RW,S4
 *   Unit = [Degree]
 */
 
#define MOTOR_HALL_ANGLE						0x64101F
#define MOTOR_HALL_ANGLE_1					0x10
#define MOTOR_HALL_ANGLE_2					0x64
#define MOTOR_HALL_ANGLE_3					0x1F
#define UART_MOTOR_HALL_ANGLE				0x704F
#define UART_MOTOR_HALL_ANGLE_H			0x70
#define UART_MOTOR_HALL_ANGLE_L			0x4F
/* MOTOR PARAMTER END */

/* MEASRUEMENT DATA START */

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Actual position
 * Attribute = 32s,RO
 *   Unit = [DEC]
 */

#define ACTUAL_POSITION							0x606300
#define ACTUAL_POSITION_1						0x63
#define ACTUAL_POSITION_2						0x60
#define ACTUAL_POSITION_3						0x00
#define UART_ACTUAL_POSITION				0x7071
#define UART_ACTUAL_POSITION_H			0x70
#define UART_ACTUAL_POSITION_L			0x71
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Actual speed_rpm
 * Sampling cycle can be changed i object 0x7079
 * Resolution: 1rpm
 * Attribute = 16s,RO
 *   Unit = [1rpm]
 */
 
#define ACTUAL_SPEED_RPM						0x60F918
#define ACTUAL_SPEED_RPM_1Byte			0xF9
#define ACTUAL_SPEED_RPM_2Byte			0x60
#define ACTUAL_SPEED_RPM_3Byte			0x18	
#define UART_ACTUAL_SPEED_RPM				0x7075
#define UART_ACTUAL_SPEED_RPM_H			0x70
#define UART_ACTUAL_SPEED_RPM_L			0x75
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Actual speed_0.001rpm
 * Sampling cycle can be changed i object 0x7079
 * Resolution: 0.001rpm
 * Attribute = 32s,RO
 *   Unit = [0.001rpm]
 */
 
#define ACTUAL_SPEED_0001_RPM						0x60F919
#define ACTUAL_SPEED_0001_RPM_1					0xF9
#define ACTUAL_SPEED_0001_RPM_2					0x60
#define ACTUAL_SPEED_0001_RPM_3					0x19
#define UART_ACTUAL_SPEED_0001_RPM			0x7076
#define UART_ACTUAL_SPEED_0001_RPM_H		0x70
#define UART_ACTUAL_SPEED_0001_RPM_L		0x76
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Sampling cycle for actual speed
 * Default:30
 * Attribute = 16U,RW,S5
 *   Unit = [ms]
 */
 
#define SAMPLE_CYCLE_ACTUAL_SPEED						0x60F91A
#define SAMPLE_CYCLE_ACTUAL_SPEED_1Byte			0xF9
#define SAMPLE_CYCLE_ACTUAL_SPEED_2Byte			0x60
#define SAMPLE_CYCLE_ACTUAL_SPEED_3Byte			0x1A
#define UART_SAMPLE_CYCLE_ACTUAL_SPEED			0x7079
#define UART_SAMPLE_CYCLE_ACTUAL_SPEED_H		0x70
#define UART_SAMPLE_CYCLE_ACTUAL_SPEED_L		0x79
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Actual speed_DEC
 * Sampling cycle is 250uS
 *[DEC]=([rpm]*512*[Resolution])/1875; [Resolution]Default:4096
 * Note:the value vibration is big because sampling cycle is too short.
 * Attribute = 32s,RO
 *   Unit = [DEC]
 */
 
