kaunghtethtun/stm32_study/Firmware V-0.0/STM32CubeIDE/Drivers/rom_drivers/Inc/ROM_LSDB4830_CAFC.h
#define ACTUAL_SPEED_DEC						0x606C00
#define ACTUAL_SPEED_DEC_1					0x6C
#define ACTUAL_SPEED_DEC_2					0x60
#define ACTUAL_SPEED_DEC_3					0x00	
#define UART_ACTUAL_SPEED_DEC				0x7077
#define UART_ACTUAL_SPEED_DEC_H			0x70
#define UART_ACTUAL_SPEED_DEC_L			0x77
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Actual current_Iq
 * [DEC]=[Arms]*1.414*2048/I_MAX
 * Note:For L2DB4830 series，I_MAX=33；
 * Attribute = 16S,RO
 *   Unit = [DEC]
 */
 
#define ACTUAL_CURRENT_Iq						0x607800
#define ACTUAL_CURRENT_Iq_1					0x78
#define ACTUAL_CURRENT_Iq_2					0x60
#define ACTUAL_CURRENT_Iq_3					0x00
#define UART_ACTUAL_CURRENT_Iq			0x7072
#define UART_ACTUAL_CURRENT_Iq_H		0x70
#define UART_ACTUAL_CURRENT_Iq_L		0x72
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Motor actual IIt current
 * Attribute = 16U,RO
 *   Unit = [mA]
 */
 
#define MOTOR_ACUTAL_IIt_CURRENT					0x60F632
#define MOTOR_ACUTAL_IIt_CURRENT_1				0xF6
#define MOTOR_ACUTAL_IIt_CURRENT_2				0x60
#define MOTOR_ACUTAL_IIt_CURRENT_3				0x32
#define UART_MOTOR_ACUTAL_IIt_CURRENT			0x7007
#define UART_MOTOR_ACUTAL_IIt_CURRENT_H		0x70
#define UART_MOTOR_ACUTAL_IIt_CURRENT_L		0x07
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Actual DC bus voltage
 * Resolution:1V
 * Attribute = 16S,RO
 *   Unit = [V]
 */
 
#define ACTUAL_DC_VOLTAGE						0x60F712
#define ACTUAL_DC_VOLTAGE_1					0xF7
#define ACTUAL_DC_VOLTAGE_2					0x60
#define ACTUAL_DC_VOLTAGE_3					0x12
#define UART_ACTUAL_DC_VOLTAGE			0x5001
#define UART_ACTUAL_DC_VOLTAGE_H		0x50
#define UART_ACTUAL_DC_VOLTAGE_L		0x01
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Driver actual temperature
 * Attribute = 16S,RO
 *   Unit = ['C]
 */
 
#define DRIVER_ACTUAL_TEMP					0x60F70B
#define DRIVER_ACTUAL_TEMP_1				0xF7
#define DRIVER_ACTUAL_TEMP_2				0x60
#define DRIVER_ACTUAL_TEMP_3				0x0B
#define UART_DRIVER_ACTUAL_TEMP			0x7002
#define UART_DRIVER_ACTUAL_TEMP_H		0x70
#define UART_DRIVER_ACTUAL_TEMP_L		0x02
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Actual position following error
 * Attribute = 32S,RO
 *   Unit = [DEC]
 */
 
#define ACTUAL_POSITION_ERROR					0x60F400
#define ACTUAL_POSITION_ERROR_1				0xF4
#define ACTUAL_POSITION_ERROR_2				0x60
#define ACTUAL_POSITION_ERROR_3				0x00
#define UART_ACTUAL_POSITION_ERROR		0x7092
#define UART_ACTUAL_POSITION_ERROR_H	0x70
#define UART_ACTUAL_POSITION_ERROR_L	0x92
/* MEASRUEMENT DATA END */

/* IO PORT SETTING START */

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Actual states of digital input(Hardware states) 
 * BIT[0]—DIN1_State
 * BIT[1]—DIN2_State
 *  …
 * BIT[7]—DIN8_State
 * The corresponding bit will be set 1 when DINx is valid,or it will be set 0 
 * Attribute = 16U,RO
 *    Unit = [BIT]
 */

#define ACTUAL_STATE_DIGI_INPUT			0x20100A
#define ACTUAL_STATE_DIGI_INPUT_1		0x10
#define ACTUAL_STATE_DIGI_INPUT_2		0x20
#define ACTUAL_STATE_DIGI_INPUT_3		0x0A

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Digital input polarity setting
 * BIT[0]—DIN1_Polarity
 * BIT[1]—DIN2_Polarity 
 * …
 * BIT[7]—DIN8_Polarity
 * DIN[x+1] polarity is negation when BIT[x] is set as 0
 * Default：0x00ff
 * Attributes = 16U,RO,S2
 *   Unit = [BIT]
 */
 
#define DIGI_INPUT_POLARITY_SET			0x201001
#define DIGI_INPUT_POLARITY_SET_1		0x10
#define DIGI_INPUT_POLARITY_SET_2		0x20
#define DIGI_INPUT_POLARITY_SET_3		0x01

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Digital input simulate
 * BIT[0]—DIN1_Simulate
 * BIT[1]—DIN2_Simulate
 * …
 * BIT[7]—DIN8_Simulate
 * DIN[x+1] is valid when BIT[x] as 1
 * Attributes = 16U,RW
 *   Unit = [BIT]
 */
 
#define DIGI_INPUT_SIMULATE					0x201002
#define DIGI_INPUT_SIMULATE_1				0x10
#define DIGI_INPUT_SIMULATE_2				0x20
#define DIGI_INPUT_SIMULATE_3				0x02

/* IO PORT SETTING END */

/* COMMUNICATION PARAMETERS START */

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * UART baudrate setting
 * Setting value    baudrate
 * 		    3          19200
 *	    	4          38400
 * 	     	5          56000
 * 	     	6          57600
 * 		    7         115200
 * It must save and reboot driver. 
 * Default:7
 * Attribute = 08U,RW,S1
 *    Unit = [DEC]
 */
 
#define UART_BAUNDRATE_SET					0x2FE001
#define UART_BAUNDRATE_SET_1				0xE0
#define UART_BAUNDRATE_SET_2				0x2F
#define UART_BAUNDRATE_SET_3				0x01

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * RS485/CAN ID
 * Activate when DIP switch SW3 set as OFF 
 * Default:17
 * Attribute = 08U,RW,S1 
 *   Unit = [DEC]
 */
 
#define RS485_CAN_ID								0x65100F
#define RS485_CAN_ID_1							0x10
#define RS485_CAN_ID_2							0x65
#define RS485_CAN_ID_3							0x0F

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Communication loss protection
 * 0:Disable
 * 1:Enable
 * Default:depend on different model
 * Attribute = 08U,RW,S1
 *    Unit = [DEC]
 */
 
#define COMMUNICATION_LOSS_PROTECT					0x410010 
#define COMMUNICATION_LOSS_PROTECT_1				0x00 
#define COMMUNICATION_LOSS_PROTECT_2				0x41 
#define COMMUNICATION_LOSS_PROTECT_3				0x10 
#define COMMUNICATION_LOSS_PROTECT_DISABLE	0
#define COMMUNICATION_LOSS_PROTECT_ENABLE		1

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Communication loss delay time
 * Default:600
 * Attribute = 32U,RW,S1
 *   Unit = [mS]
 */
 
#define COMMUNICATION_LOSS_DELAY		0x410011
#define COMMUNICATION_LOSS_DELAY_1	0x00
#define COMMUNICATION_LOSS_DELAY_2	0x41
#define COMMUNICATION_LOSS_DELAY_3	0x11

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Simple PDO function
 * 0：Disable
 * 1：Enable TXPDO1（Auto-upload "Actual position" and "Actual velocity_0.001rpm" ）
 * Default：0
 * Attribute = 08U,RW
 *    Unit = [DEC]
 */
 
#define SIMPLE_PDO_FUN							0x470001
#define SIMPLE_PDO_FUN_1						0x00
#define SIMPLE_PDO_FUN_2						0x47
#define SIMPLE_PDO_FUN_3						0x01
#define SIMPLE_PDO_FUN_DISABLE			0
#define SIMPLE_PDO_FUN_ENABLE				1

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * TX-PDO1 prohibit time
 * Default:10ms
 * Attribute = 16U,RW
 *    Unit = [mS]
 */
 
