kaunghtethtun/stm32_study/Firmware V-0.0/STM32CubeIDE/Drivers/rom_drivers/Inc/ROM_LSDB4830_CAFC.h
#define TX_PDO1_PROHIBIT_TIME				0x180003
#define TX_PDO1_PROHIBIT_TIME_1			0x00
#define TX_PDO1_PROHIBIT_TIME_2			0x18
#define TX_PDO1_PROHIBIT_TIME_3			0x03 

/* Communication Parameters End */

/* PARAMETERS STORAGE START */

 /**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Save group S1 parameters
 * 1:Save
 * Attribute = 08U,RW
 *   Unit = [DEC]
 */
 
#define SAVE_GROUP_S1								0x2FE501
#define SAVE_GROUP_S1_1							0xE5
#define SAVE_GROUP_S1_2 						0x2F
#define SAVE_GROUP_S1_3							0x01
#define SAVE_GROUP_S1_SAVE					1

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Save group S2 parameters
 * 1:Save
 * Attribute = 08U,RW
 *   Unit = [DEC]
 */
 
#define SAVE_GROUP_S2								0x2FE502
#define SAVE_GROUP_S2_1							0xE5
#define SAVE_GROUP_S2_2 						0x2F
#define SAVE_GROUP_S2_3							0x02
#define SAVE_GROUP_S2_SAVE					1

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Save group S3 parameters
 * 1:Save
 * Attribute = 08U,RW
 *   Unit = [DEC]
 */
 
#define SAVE_GROUP_S3								0x2FE503
#define SAVE_GROUP_S3_1							0xE5
#define SAVE_GROUP_S3_2 						0x2F
#define SAVE_GROUP_S3_3							0x03
#define SAVE_GROUP_S3_SAVE					1

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Save group S4 parameters
 * 1:Save
 * Attribute = 08U,RW
 *   Unit = [DEC]
 */
 
#define SAVE_GROUP_S4								0x2FE504
#define SAVE_GROUP_S4_1							0xE5
#define SAVE_GROUP_S4_2							0x2F
#define SAVE_GROUP_S4_3							0x04
#define SAVE_GROUP_S4_SAVE					1

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Save group S5 parameters
 * 1:Save
 * Attribute = 08U,RW
 *   Unit = [DEC]
 */
 
#define SAVE_GROUP_S5								0x2FE505
#define SAVE_GROUP_S5_1							0xE5
#define SAVE_GROUP_S5_2 						0x2F
#define SAVE_GROUP_S5_3							0x05
#define SAVE_GROUP_S5_SAVE					1

/* PARAMETERS STORAGE END */

/* DRIVER ATTRIBUTE START */

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Driver mode 1 - series
 * Default:L2DB
 * Attribute = 32U,RO
 *   Unit = [ASCII]
 */
 
#define DRIVER_MODE_1_SERIES				0x30003A
#define DRIVER_MODE_1_SERIES_1			0x00
#define DRIVER_MODE_1_SERIES_2			0x30
#define DRIVER_MODE_1_SERIES_3			0x3A

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Driver mode 2 – voltage and current
 * Default:4830
 * Attribute = 32U,RO
 *   Unit = [ASCII]
 */
 
#define DRIVER_MODE_2_VOLT_CURR			0x30003B
#define DRIVER_MODE_2_VOLT_CURR_1		0x00
#define DRIVER_MODE_2_VOLT_CURR_2		0x30
#define DRIVER_MODE_2_VOLT_CURR_3		0x3B

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Driver mode 3 - communication
 * Default:
 * RS485:CAFR 
 * CAN:CAFC
 * Attribute = 32U,RO
 *   Unit = [ASCII]
 */
 
#define DRIVER_MODE_3_COMMUNITY			0x30003C
#define DRIVER_MODE_3_COMMUNITY_1		0x00
#define DRIVER_MODE_3_COMMUNITY_2		0x30
#define DRIVER_MODE_3_COMMUNITY_3		0x3C

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Driver mode 4 – software version
 * Default:
 * For 7Nm motor:ASL3 = 0x41534C33
 * For 10Nm motor:ASM4 = 0x41536D34
 * For 15Nm motor:ASM5 = 0x41536D35
 * Attribute = 32U,RO
 *   Unit = [ASCII]
 */
 
#define DRIVER_MODE_4_SOFTWARE_VER			0x30003D
#define DRIVER_MODE_4_SOFTWARE_VER_1		0x00
#define DRIVER_MODE_4_SOFTWARE_VER_2		0x30
#define DRIVER_MODE_4_SOFTWARE_VER_3		0x3D

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Firmware date
 * Format:20190114
 * Year: 2019
 * Month: 01
 * Day: 14
 * Attribute = 32U,RO
 *   Unit = [DEC]
 */
 
#define FIRMWARE_DATE								0x2500F1 
#define FIRMWARE_DATE_1							0x00 
#define FIRMWARE_DATE_2							0x25 
#define FIRMWARE_DATE_3 						0xF1 

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Hardware version
 * Attribute = 32U,RO
 *   Unit = [ASCII]
 */
 
#define	HARDWARE_VER								0x2500F3
#define	HARDWARE_VER_1							0x00
#define	HARDWARE_VER_2							0x25
#define	HARDWARE_VER_3							0xF3

/* DRIVER ATTRIBUTE END */

/* ADDITIONAL FUNCTIONS START */

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Sstop function
 * 0:Disable
 * 1:Enable
 * Default:0
 * It is used to limit driver output current when motor is in zero speed.
 * Attribute = 08U,RW,S5
 *    Unit = [DEC]
 */
 
#define SSTOP_FUNCTION							0x500020
#define SSTOP_FUNCTION_1						0x00
#define SSTOP_FUNCTION_2						0x50
#define SSTOP_FUNCTION_3						0x20 
#define SSTOP_FUNCTION_DISABLE			0
#define SSTOP_FUNCTION_ENABLE				1	
#define UART_SSTOP_FUNCTION					0x802F
#define UART_SSTOP_FUNCTION_H				0x80
#define UART_SSTOP_FUNCTION_L				0x2F
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Sstop current limit
 * U[y，x]：
 * [DEC]=[Arms]*1.414*2048*256/I_MAX
 * Note:L2DB4830 series，I_MAX=33；
 * Default：
 * L2DB4830 series：10485 (0.467Arms)
 * Attribute = 32U,RW,S5
 *    Unit = [DEC]
 */
 
#define SSTOP_CURRENT_LIMIT					0x500028
#define SSTOP_CURRENT_LIMIT_1				0x00
#define SSTOP_CURRENT_LIMIT_2				0x50
#define SSTOP_CURRENT_LIMIT_3				0x28
#define UART_SSTOP_CURRENT_LIMIT		0x8028
#define UART_SSTOP_CURRENT_LIMIT_H	0x80
#define UART_SSTOP_CURRENT_LIMIT_L	0x28
// need to check for I_max value and Arms value

/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * S curve start point at decelerating
 * U[y,x]:
 * [DEC]=([rpm]*512*[Resolution])/1875;
 * [Resolution]Default:4096
 * Default:5rpm
 * Attribute = 32U,RW,S5
 *    Unit = [DEC]
 */
 
#define S_CURVE_START_DECELERATE					0x500002
#define S_CURVE_START_DECELERATE_1				0x00
#define S_CURVE_START_DECELERATE_2				0x50
#define S_CURVE_START_DECELERATE_3				0x02
#define UART_S_CURVE_START_DECELERATE			0x8002
#define UART_S_CURVE_START_DECELERATE_H		0x80
#define UART_S_CURVE_START_DECELERATE_L		0x02
/**
 * @brief CAN Object address [16bits][8bits] (Index SubIndex)
 * Time for S curve 
 * Default:64
 * Attribute  = 16U,RW,S5
 *    Unit = [DEC]
 */
 
#define TIME_S_CURVE								0x500004
#define TIME_S_CURVE_1							0x00
#define TIME_S_CURVE_2							0x50
#define TIME_S_CURVE_3							0x04
#define UART_TIME_S_CURVE						0x8004
#define UART_TIME_S_CURVE_H					0x80
#define UART_TIME_S_CURVE_L					0x04
/* ADDITIONAL FUNCTIONS END */

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * Simple PDO Function
  *  Default = 0 [ Disable TXPDO1
  *  Attribute = 08U,RW
  *     Unit   = [DEC]
  */
	
#define SIMPLE_PDO									0x470001
#define SIMPLE_PDO_1ST_BYTE					0x00
#define SIMPLE_PDO_2ND_BYTE					0x47
#define SIMPLE_PDO_3RD_BYTE					0x01
#define SIMPLE_PDO_ENABLE						1U
#define SIMPLE_PDO_DISABLE					0U

/**
  * @brief CAN Object Address  [16bits][8bits] ( Index, subindex )
  * TX-PDO1 prohibit time
  *  Default = 10mS
  *  Attribute = 16U,RW
  *     Unit   = [mS]
  */

#define TX_PDO1											0x180003
#define TX_PDO1_1ST_BYTE						0x00
#define TX_PDO1_2ND_BYTE						0x18
#define TX_PDO1_3RD_BYTE						0x03

/* Sending CMD */
#define SEND_ONE_BYTE								0x2F				// Write mode
#define SEND_TWO_BYTE								0x2B				// Write mode
#define SEND_FOURBYTE								0x23				// Write mode
#define SEND_REQUEST								0x40				// Read mode

/* Receiving CMD */
#define RECEIVE_ONE_BYTE						0x4F
#define RECEIVE_TWO_BYTE						0x4B
#define RECEIVE_FOURBYTE						0x43

#define RECEIVE_ERROR								0x80
#define RECEIVE_SUCCESS							0x60

