kaunghtethtun/stm32_study/Firmware V-0.0/STM32CubeIDE/Drivers/rom_drivers/Inc/ROM_LSDB4830_CAFC.h
/* Untest APIs ( function prototypes ) */
void ___ROM_LSDB_PREPARE(CAN_HandleTypeDef *p_hcan1);
void CAN1_FILTER_Config(CAN_HandleTypeDef *p_hcan1);

/*** SPEED MODE START ***/
/* SPEED_MODE_WITH_ACCEL_DECEL , SPEED_MODE, TORQUE_MODE, POSITION_MODE */
void setOperatingMode(CAN_HandleTypeDef *p_hcan1, int8_t mode);

/* CONTROL_WORD_ENABLE , CONTROL_WORD_DISABLE , CONTROL_WORD_CLEAR */
void enableMotorRight(CAN_HandleTypeDef *p_hcan1, int16_t flag);
void enableMotorLeft(CAN_HandleTypeDef *p_hcan1, int16_t flag);

/* DRIVER_STATUS_NORMAL , DRIVER_STATUS_ERROR  */
void getDriverStatus(CAN_HandleTypeDef *p_hcan1);

/* EMERGENCY_STOP_ENABLE , EMERGENCY_STOP_DISABLE */
void EmergencyMode(CAN_HandleTypeDef *p_hcan1, uint8_t flag);
void decel_in_emergency_stop(CAN_HandleTypeDef *p_hcan1, uint32_t flag);

/* Acceleration */
void setAccel(CAN_HandleTypeDef *p_hcan1,uint32_t rev_per_sec_sqr);
uint32_t calculateAccel (uint32_t rev_per_sec_sqr);
void transmitAccel(CAN_HandleTypeDef *p_hcan1, uint32_t flag);

/* Deceleration */
uint32_t calculateDecel (uint32_t rev_per_sec_sqr);
void setDecel(CAN_HandleTypeDef *p_hcan1,uint32_t rev_per_sec_sqr);
void transmitDecel(CAN_HandleTypeDef *p_hcan1, uint32_t flag);

/* be care, input are signed params */
void setTargetVelocityRpmRight(CAN_HandleTypeDef *p_hcan1, int16_t rpm);
void setTargetVelocityRpmLeft(CAN_HandleTypeDef *p_hcan1, int16_t rpm);
void setTargetVelocityDEC(CAN_HandleTypeDef *p_hcan1, int32_t dec);

/* */
void max_following_error(CAN_HandleTypeDef *p_hcan1, uint32_t flag);

/* */
void position_loop_speed_feedforward(CAN_HandleTypeDef *p_hcan1, int16_t flag);

/* */
void set_position_propotion_gain(CAN_HandleTypeDef *p_hcan1, int16_t flag);

/* */
void set_speed_propotion_gain(CAN_HandleTypeDef *p_hcan1, uint16_t flag);

/* */
void set_speed_integration_gain(CAN_HandleTypeDef *p_hcan1, uint16_t flag);
/*** SPEED MODE END ***/

/* SIMPLE_PDO_ENABLE , SIMPLE_PDO_DISABLE */
void enableTenMilliSecondLoop(CAN_HandleTypeDef *p_hcan1, uint8_t flag);

/* MAXIMUM SPEED SETTING maximum=120rpm */
void setMaxRPM(CAN_HandleTypeDef *p_hcan1, uint8_t rpm);

/* Radian per second <=> RPM */
int16_t rdsToRPM (double rds);
double rpmToRds (int16_t rpm);

/* Speed Related Funtions */
void setActualSpeedSamplingCycle(CAN_HandleTypeDef *p_hcan1, uint16_t milliSec);
void getActualRpmRight(CAN_HandleTypeDef *p_hcan1);
void getActualRpmLeft(CAN_HandleTypeDef *p_hcan1);
void disableMotors(CAN_HandleTypeDef *p_hcan1);
void clearMotors(CAN_HandleTypeDef *p_hcan1);


/* Position Related Functions */
void clearActualPostion(CAN_HandleTypeDef *p_hcan1);

/* Noise Reduction */
void enableNoiseReductionatZeroSpeed (CAN_HandleTypeDef *p_hcan1);

/* TO DO */ 
// check port setting()
//void getActualDCBusVoltage(CAN_HandleTypeDef *p_hcan1);

// check communication parameters()
// check parameter storage()
// check driver attribute()



#endif

